expensemanager/app/views/incomes/_form.html.erb

									<%= fact.label :category %>
									<%= fact.collection_select "icname", Icategory.all, :icname, :icname  %>
---
SELECT "icategories".* FROM "icategories"