expensemanager/app/views/expenses/edit.html.erb

									<%= fact.label :category %>
									<%= fact.collection_select "cname", Category.all, :cname, :cname  %>
---
SELECT "categories".* FROM "categories"