expensemanager/app/views/expenses/new.html.erb

SELECT "categories".* FROM "categories"
---
									<%= fact.label :category %>
									<%= fact.collection_select "cname", Category.all, :cname, :cname  %>