expensemanager/app/controllers/access_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Aesha"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."password" = ? LIMIT ?  [["password", "asd1506"], ["LIMIT", 1]]
---
  def attempt_login
	  user=User.find_by_name(params[:name])
	  user_password = User.find_by_password(params[:password])