expensemanager/app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
---
  def show
    @categories = Category.all

INSERT INTO "categories" ("cname", "created_at", "updated_at") VALUES (?, ?, ?)  [["cname", "Rent"], ["created_at", "2017-08-10 17:13:27.552138"], ["updated_at", "2017-08-10 17:13:27.552138"]]
---
  def create
	@category = Category.new(category_params)

	respond_to do |format|
		if @category.save

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "categories" SET "cname" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["cname", "Travel"], ["updated_at", "2017-08-10 20:32:40.192331"], ["id", 4]]
---
  def update
		  @category = Category.find(params[:id])

		  if @category.update(category_params)