expensemanager/app/controllers/expenses_controller.rb

  def index
  require 'csv'
  @expenses = Expense.all
---
SELECT "expenses".* FROM "expenses"

  def show
	@expenses = Expense.all
---
SELECT "expenses".* FROM "expenses"

  def create
   @expense = Expense.new(expense_params)

	  respond_to do |format|
		if @expense.save
---
INSERT INTO "expenses" ("amount", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["amount", 243], ["user_id", 1], ["created_at", "2017-08-11 20:23:23.404453"], ["updated_at", "2017-08-11 20:23:23.404453"]]

  def update
	@expense = Expense.find(params[:id])

		  if @expense.update(expense_params)
---
SELECT  "expenses".* FROM "expenses" WHERE "expenses"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "expenses" SET "amount" = ?, "updated_at" = ? WHERE "expenses"."id" = ?  [["amount", 222], ["updated_at", "2017-08-11 23:07:31.233848"], ["id", 3]]

  def destroy
	@expense = Expense.find(params[:id])
		@expense.destroy
---
SELECT  "expenses".* FROM "expenses" WHERE "expenses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "expenses" WHERE "expenses"."id" = ?  [["id", 1]]

  def set_expense
	@expense = Expense.find_by(:id => params[:id], :user_id => session[:user_id])
---
SELECT  "expenses".* FROM "expenses" WHERE "expenses"."id" = ? AND "expenses"."user_id" = ? LIMIT ?  [["id", 4], ["user_id", 1], ["LIMIT", 1]]