expensemanager/app/controllers/icategories_controller.rb

SELECT "icategories".* FROM "icategories"
---
  def index
	@icategories = Icategory.all

SELECT "icategories".* FROM "icategories"
---
  def show
    @icategories = Icategory.all

SELECT  "icategories".* FROM "icategories" WHERE "icategories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
	@icategory = Icategory.find(params[:id])

INSERT INTO "icategories" ("icname", "created_at", "updated_at") VALUES (?, ?, ?)  [["icname", "PrimaryJob"], ["created_at", "2017-08-12 01:23:42.063118"], ["updated_at", "2017-08-12 01:23:42.063118"]]
---
  def create
	@icategory = Icategory.new(icategory_params)

	respond_to do |format|
		if @icategory.save

SELECT  "icategories".* FROM "icategories" WHERE "icategories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "icategories" SET "icname" = ?, "updated_at" = ? WHERE "icategories"."id" = ?  [["icname", "Primaryjob"], ["updated_at", "2017-08-12 01:23:57.335132"], ["id", 1]]
---
  def update
		  @icategory = Icategory.find(params[:id])

		  if @icategory.update(icategory_params)

SELECT  "icategories".* FROM "icategories" WHERE "icategories"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "icategories" WHERE "icategories"."id" = ?  [["id", 3]]
---
  def destroy
		@icategory = Icategory.find(params[:id])
		@icategory.destroy