expensemanager/app/controllers/incomes_controller.rb

SELECT "incomes".* FROM "incomes"
---
	def index
		require 'csv'
		@incomes = Income.all

SELECT "incomes".* FROM "incomes"
---
	def show
		@incomes = Income.all

INSERT INTO "incomes" ("amount", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["amount", 4000], ["user_id", 1], ["created_at", "2017-08-11 00:29:29.544387"], ["updated_at", "2017-08-11 00:29:29.544387"]]
---
	def create
	  @income=Income.new(income_params)

	  respond_to do |format|
		if @income.save

SELECT  "incomes".* FROM "incomes" WHERE "incomes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "incomes" SET "amount" = ?, "updated_at" = ? WHERE "incomes"."id" = ?  [["amount", 40000], ["updated_at", "2017-08-11 07:23:29.862843"], ["id", 1]]
---
	def update
	@income = Income.find(params[:id])

		  if @income.update(income_params)

SELECT  "incomes".* FROM "incomes" WHERE "incomes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "incomes" WHERE "incomes"."id" = ?  [["id", 2]]
---
	def destroy
	@income = Income.find(params[:id])
		@income.destroy

SELECT  "incomes".* FROM "incomes" WHERE "incomes"."id" = ? AND "incomes"."user_id" = ? LIMIT ?  [["id", 2], ["user_id", 1], ["LIMIT", 1]]
---
	def set_income
	@income = Income.find_by(:id => params[:id], :user_id => session[:user_id])