expensemanager/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "password", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Aesha"], ["password", "jsk"], ["email", "aesha1506@gmail.com"], ["created_at", "2017-08-10 00:41:29.469765"], ["updated_at", "2017-08-10 00:41:29.469765"]]
---
  def create
  @user = User.new(user_params)

    respond_to do |format|
      if @user.save